title: Captain Vorpatril's Alliance
description: "Book Fourteen in the best-selling Vorkosigan series. Captain Ivan Vorpatril is happy with his relatively uneventful bachelor's life of a staff officer to a Barrayaran admiral.  Ivan, cousin to Imperial troubleshooter Miles Vorkosigan, is not far down the hereditary list for the emperorship.  Thankfully, new heirs have directed that headache elsewhere, leaving Ivan to enjoy his life on Komarr, far from the Byzantine court politics of his home system.  But when an old friend in Barrayaran intelligence asks Ivan to protect an attractive young woman who may be on the hit list of a criminal syndicate, Ivan's chivalrous nature takes over.  It seems danger and adventure have once more found Captain Vorpatril. Tej Arqua and her half-sister and servant Rish are fleeing the violent overthrow of their clan on free-for-all planet Jackson's Whole.  Now it seems Tej may possess a hidden secret of which even she may not be aware.  It's a secret that could corrupt the heart of a highly regarded Barayarran family and provide the final advantage for the thugs who seek to overthrow Tej's homeworld.  But none of Tej's formidable adversaries have counted on Ivan Vorpatril.  For behind Ivan's fa&Ccedil;ade of wry and self-effacing humor lies a true and cunning protector who will never leave a distressed lady in the lurch-up to and including making the ultimate sacrifice to keep her from harm: the treasured and hard-won freedom from his own fate as a scion of Barrayar.  About Lois McMaster Bujold's Vorkosigan Saga:  "Fans have been clamoring for Hugo winner Bujold to pen a new Vorkosigan Saga novel. her deft and absorbing writing easily corrals the complex plot."--Publishers Weekly on Cryoburn  "Bujold mixes quirky humor with action [and] superb character development...[E]normously satisfying."--Publishers Weekly. "One of sf's outstanding talents. an outstanding series."--Booklist ". an intelligent, well-crafted and thoroughly satisfying blend of adventure, sociopolitical commentary, scientific experiments, and occasional perils. with that extra spicing of romance."--Locus About Vorkosigan series entry Diplomatic Immunity: "Bujold is adept at world-building and provides a witty, character-centered plot, full of exquisite grace notes. fans will be thoroughly gripped and likely to finish the book in a single sitting."--Publishers Weekly"--

"Captain Ivan Vorpatril is happy with his relatively uneventful bachelor's life of a staff officer to a Barrayaran Admiral. Ivan, cousin to Imperial troubleshooter Miles Vorkosigan, is not far down the hereditary list for the emperorship. Thankfully, new heirs have directed that headache elsewhere leaving Ivan to enjoy like on Komarr. But when and old friend in Barrayaran intelligence asks Ivan to protect an attractive young woman Tej Arqua his chivalrous nature takes over and danger finds him once again. Tej and her half-sister Rish are fleeing the violent overthrow of their clan but it seems Tej may possess a hidden secret that could corrupt the heart of a highly regarded Barrayarn family. But none of Tej's formidable adversaries have counted on Ivan Vorpatril. Behind his facade of wry and self effacing humor lies a true and cunning protector who will never leave a distressed lady in the lurch"--
rating: 4.071428571428571
rating_count: 77
pages: None
release_date: 2012-01-01