title: The Dispossessed
description: The story takes place on the fictional planet Urras and its moon Anarres (since Anarres is massive enough to hold an atmosphere, this is often described as a double planet system). In order to forestall an anarcho-syndical workers' rebellion, the major Urrasti states gave the revolutionaries the right to live on Anarres, along with a guarantee of non-interference, approximately two hundred years before the events of The Dispossessed.[2] Before this, Anarres had had no permanent settlements apart from some mining.

The protagonist Shevek is a physicist attempting to develop a General Temporal Theory. The physics of the book describes time as having a much deeper, more complex structure than we understand it. It incorporates not only mathematics and physics, but also philosophy and ethics. The meaning of the theories in the book weaves nicely into the plot, not only describing abstract physical concepts, but the ups and downs of the characters' lives, and the transformation of the Anarresti society. An oft-quoted saying in the book is "true journey is return." [3].

Anarres is in theory a society without government or coercive authoritarian institutions. Yet in pursuing research that deviates from his society's current consensus understanding, Shevek begins to come up against very real obstacles. Shevek gradually develops an understanding that the revolution which brought his world into being is stagnating, and power structures are beginning to exist where there were none before. He therefore embarks on the risky journey to the original planet, Urras, seeking to open dialog between the worlds and to spread his theories freely outside of Anarres. The novel details his struggles on both Urras and his homeworld of Anarres.

The book also explores the Sapir-Whorf Hypothesis, that language shapes thinking, and thus, culture. The language spoken on the anarchist planet Anarres, Pravic, is a constructed language that reflects many aspects of the philosophical foundations of utopian anarchism. For instance, the use of the possessive case is strongly discouraged. In one scene, Shevek's daughter, meeting him for the first time, offers him "You can share the handkerchief I use,"[4] rather than "you may borrow my handkerchief", thus conveying the idea that the handkerchief is not owned by the girl, merely carried by her.[5]
Cover of first paperback edition

The Dispossessed looks into the mechanisms that may be developed by an anarchist society, but also the dangers of centralization and bureaucracy that might easily take over such society without the continuation of revolutionary ideology. Part of its power is that it gives a spectrum of fairly well-developed characters, who illustrate many types of personalities, all educated in an environment that measures a person not by what he owns, but by what he can do, and how he relates to other human beings. Possibly the best example of this is the character of Takver, the hero's partner, who exemplifies many virtues: loyalty, love of life and living things, perseverance, and desire for a true partnership with another person.

The work is sometimes said to represent one of the few modern revivals of the utopian genre, [6] and there are certainly many characteristics of a utopian novel found in this book. Most obviously, Shevek is an outsider in Urras, following the "traveler" convention common in utopian literature. All of the characters portrayed in the novel have a certain spirituality or intelligence, there are no nondescript characters. It is also true to say that there are aspects of Anarres that are utopian: it is presented as a pure society that adheres to its own theories and ideals, which are starkly juxtaposed with Urras society.

However, the work is subtitled "An Ambiguous Utopia", and one of the major themes of the work is the ambiguity of different notions of utopia. Anarres is not presented as a perfect society, even within the constraints of what might define an anarchist utopia. Bureaucracy, stagnation, and power structures have problematized the revolution, as Shevek understands through the course of the novel. Moreover, Le Guin has painted a very stark picture of the natural and environmental constraints on society. Anarres citizens are forced to contend with a relatively sparse and unfruitful world. Hardship caused by lack of resources is a prominent theme, reflected in the title of the novel. Anarres citizens are dispossessed not just by political choice, but by the very lack of resources to possess. Here, again, Le Guin draws a contrast with the natural wealth of Urras, and the competitive behaviors this fosters. Le Guin's foreword to the novel notes that her anarchism is closely akin to that of Pyotr Kropotkin's, whose Mutual Aid closely assessed the influence of the natural world on competition and cooperation.[7] Le Guin's use of realism in this aspect of the work further problematizes — ambiguates — a simple utopian interpretation of the work. Anarres is not a perfect society, and Le Guin shows that no such thing is possible.
rating: 4.175619834710743
rating_count: 484
pages: 400
release_date: 1974-01-01