title: The Big Time
description: You can't know there's a war on--for the Snakes coil and Spiders weave to keep you from knowing it's being fought over your live and dead body!ExcerptMy name is Greta Forzane. Twenty-nine and a party girl would describe me. I was born in Chicago, of Scandinavian parents, but now I operate chiefly outside space and time--not in Heaven or Hell, if there are such places, but not in the cosmos or universe you know either.I am not as romantically entrancing as the immortal film star who also bears my first name, but I have a rough-and-ready charm of my own. I need it, for my job is to nurse back to health and kid back to sanity Soldiers badly roughed up in the biggest war going. This war is the Change War, a war of time travelers--in fact, our private name for being in this war is being on the Big Time. Our Soldiers fight by going back to change the past, or even ahead to change the future, in ways to help our side win the final victory a billion or more years from now. A long killing business, believe me.You don't know about the Change War, but it's influencing your lives all the time and maybe you've had hints of it without realizing.Have you ever worried about your memory, because it doesn't seem to be bringing you exactly the same picture of the past from one day to the next? Have you ever been afraid that your personality was changing because of forces beyond your knowledge or control? Have you ever felt sure that sudden death was about to jump you from nowhere? Have you ever been scared of Ghosts--not the story-book kind, but the billions of beings who were once so real and strong it's hard to believe they'll just sleep harmlessly forever? Have you ever wondered about those things you may call devils or Demons--spirits able to range through all time and space, through the hot hearts of stars and the cold skeleton of space between the galaxies? Have you ever thought that the whole universe might be a crazy, mixed-up dream? If you have, you've had hints of the Change War.How I got recruited into the Change War, how it's conducted, what the two sides are, why you don't consciously know about it, what I really think about it--you'll learn in due course.
rating: 2.5294117647058822
rating_count: 17
pages: 86
release_date: 1958-01-01