{
  "data": {
    "lists_by_pk": {
      "list_books": [
        {
          "book": {
            "title": "A Storm of Swords",
            "description": "The Seven Kingdoms are torn by strife as the three surviving contenders for the throne continue their struggle for power, Robb Stark defends his fledgling kingdom from the ravaging Greyjoys, Winterfell lies in ruins, Jon Snow confronts an escalating threat from behind the Wall, and Danerys Stormborn and her dragon allies continue to grow in power. Here is the third volume in George R. Martin's magnificent cycle of novels that includes A Game of Thrones and A Clash of Kings. As a whole, this series comprises a genuine masterpiece of modern fantasy, bringing together the best the genre has to offer. Magic, mystery, intrigue, romance, and adventure fill these pages and transport us to a world unlike any we have ever experienced. Already hailed as a classic, George R. Martin's stunning series is destined to stand as one of the great achievements of imaginative fiction. A Storm of Swords Of the five contenders for power, one is dead, another in disfavor, and still the wars rage as violently as ever, as alliances are made and broken. Joffrey, of House Lannister, sits on the Iron Throne, the uneasy ruler of the land of the Seven Kingdoms. His most bitter rival, Lord Stannis, stands defeated and disgraced, the victim of the jealous sorceress who holds him in her evil thrall. But young Robb, of House Stark, still rules the North from the fortress of Riverrun. Robb plots against his despised Lannister enemies, even as they hold his sister hostage at King's Landing, the seat of the Iron Throne. Meanwhile, making her way across a blood-drenched continent is the exiled queen, Daenerys, mistress of the only three dragons still left in the world. But as opposing forces maneuver for the final titanic showdown, an army of barbaric wildlings arrives from the outermost line of civilization. In their vanguard is a horde of mythical Others--a supernatural army of the living dead whose animated corpses are unstoppable. As the future of the land hangs in the balance, no one will rest until the Seven Kingdoms have exploded in a veritable storm of swords.",
            "rating": 4.520501835985312,
            "ratings_count": 1634,
            "pages": 992,
            "release_date": "2000-01-01",
            "slug": "a-storm-of-swords"
          }
        },
        {
          "book": {
            "title": "American Gods",
            "description": "Released from prison, Shadow finds his world turned upside down. His wife has been killed; a stranger offers him a job and Shadow, with nothing to lose, accepts. But a storm is coming. Beneath the placid surface of everyday life, a war is being fought – and the prize is the very soul of America.\n\nAn inspired combination of mythology, adventure, and illusion, American Gods is a dark and kaleidoscopic journey deep into myth and across an America at once eerily familiar and utterly alien. It is, quite simply, a contemporary masterpiece.",
            "rating": 4.014713610089332,
            "ratings_count": 1903,
            "pages": 480,
            "release_date": "2001-01-01",
            "slug": "american-gods"
          }
        },
        {
          "book": {
            "title": "The Buried Giant",
            "description": "In post-Arthurian Britain, the wars that once raged between the Saxons and the Britons have finally ceased. Axl and Beatrice, an elderly British couple, set off to visit their son, whom they haven't seen in years. And, because a strange mist has caused mass amnesia throughout the land, they can scarcely remember anything about him. As they are joined on their journey by a Saxon warrior, his orphan charge, and an illustrious knight, Axl and Beatrice slowly begin to remember the dark and troubled past they all share.\n\nBy turns savage, suspenseful, and intensely moving, The Buried Giant is a luminous meditation on the act of forgetting and the power of memory.",
            "rating": 3.5267489711934155,
            "ratings_count": 243,
            "pages": 317,
            "release_date": "2015-01-01",
            "slug": "the-buried-giant"
          }
        },
        {
          "book": {
            "title": "Tuck Everlasting",
            "description": "\"In this timeless story young Winnie Foster learns of a hidden spring in a nearby wood and meets the Tuck family, whose members reveal their astonishing discovery of the spring’s life-changing power. Now Winnie must decide what to do with her newfound knowledge―and the Tucks must decide what to do with her. But it’s not just the curious girl who is interested in their remarkable tale. A suspicious stranger is also searching for the Tucks, and he will stop at nothing until he finds them and uncovers their secret.\"-- Provided by Amazon\n",
            "rating": 3.7396907216494846,
            "ratings_count": 194,
            "pages": 192,
            "release_date": "1975-01-01",
            "slug": "tuck-everlasting"
          }
        },
        {
          "book": {
            "title": "The Lion, the Witch and the Wardrobe: A Graphic Novel",
            "description": "Four English schoolchildren find their way through the back of a wardrobe into the magic land of Narnia and assist Aslan, the golden lion, to triumph over the White Witch, who has cursed the land with eternal winter.",
            "rating": 4.361111111111111,
            "ratings_count": 36,
            "pages": 171,
            "release_date": "1950-10-16",
            "slug": "the-lion-the-witch-and-the-wardrobe-a-graphic-novel"
          }
        },
        {
          "book": {
            "title": "A Swiftly Tilting Planet",
            "description": "The Murry and OKeefe families enlist the help of the unicorn, Gaudior, to save the world from imminent nuclear war. In this companion volume to A Wrinkle In  Time (Newbery Award winner) and A Wind In The Door, fifteen-year-old  Charles Wallace and the unicorn Gaudior undertake a perilous journey through time in a desperate attempt to stop the destruction of the world by the  mad dictator Madog Branzillo. They are not alone in  their quest. Charles Wallace's sister, Meg -- grown and expecting her first child, but still able to enter her brother's thoughts and emotions by \"kything\" -- goes with him in spirit. But in overcoming the challenges, Charles Wallace must face the ultimate test of his faith and  will, as he is sent within four people from  another time, there to search for a way to avert the  tragedy threatening them all. - Publisher.",
            "rating": 3.9246575342465753,
            "ratings_count": 146,
            "pages": 320,
            "release_date": "1978-01-01",
            "slug": "a-swiftly-tilting-planet"
          }
        },
        {
          "book": {
            "title": "The Tombs of Atuan",
            "description": "A wizard enters the underground domain of Ahra, high priestess of the Powers of the Earth, in an attempt to steal her palace's greatest treasure.",
            "rating": 4.058290155440415,
            "ratings_count": 386,
            "pages": 208,
            "release_date": "1970-01-01",
            "slug": "the-tombs-of-atuan"
          }
        },
        {
          "book": {
            "title": "All the Birds in the Sky",
            "description": "Childhood friends Patricia Delfine, a witch, and Laurence Armstead, a mad scientist, parted ways under mysterious circumstances during middle school. But as adults they both wind up in near-future San Francisco, where Laurence is an engineering genius and Patricia works with a small band of other magicians to secretly repair the world's ever growing ailments. But something is determined to bring them back together - to either save the world, or end it",
            "rating": 3.615546218487395,
            "ratings_count": 238,
            "pages": null,
            "release_date": "2016-01-01",
            "slug": "all-the-birds-in-the-sky"
          }
        },
        {
          "book": {
            "title": "Roald Dahl James and the Giant Peach: The Book and Movie Scrapbook",
            "description": "Offers a glimpse into the life of Roald Dahl, author of \"James and the Giant Peach,\" and tells the story of how the book was made into a movie.",
            "rating": 4,
            "ratings_count": 3,
            "pages": 57,
            "release_date": "1996-01-01",
            "slug": "roald-dahl-james-and-the-giant-peach"
          }
        },
        {
          "book": {
            "title": "Neverwhere",
            "description": "\"Richard Mayhew is an ordinary young man with an ordinary life and a good heart. His world is changed forever when he stops to help a girl he finds bleeding on a London sidewalk. This small kindness propels him into a dark world he never dreamed existed. He must learn to survive in London Below, in a world of perpetual shadows and darkness, filled with monsters and saints, murderers and angels. He must survive if he is ever to return to the London that he knew.\"",
            "rating": 4.108614232209738,
            "ratings_count": 1068,
            "pages": 480,
            "release_date": "1996-01-01",
            "slug": "neverwhere"
          }
        },
        {
          "book": {
            "title": "The Dragon Republic",
            "description": "The war is over.\n\nThe war has just begun.\n\nThree times throughout its history, Nikan has fought for its survival in the bloody Poppy Wars. Though the third battle has just ended, shaman and warrior Rin cannot forget the atrocity she committed to save her people. Now she is on the run from her guilt, the opium addiction that holds her like a vice, and the murderous commands of the fiery Phoenix—the vengeful god who has blessed Rin with her fearsome power.\n\nThough she does not want to live, she refuses to die until she avenges the traitorous Empress who betrayed Rin’s homeland to its enemies. Her only hope is to join forces with the powerful Dragon Warlord, who plots to conquer Nikan, unseat the Empress, and create a new republic.\n\nBut neither the Empress nor the Dragon Warlord are what they seem. The more Rin witnesses, the more she fears her love for Nikan will force her to use the Phoenix’s deadly power once more.\n\nBecause there is nothing Rin won’t sacrifice to save her country . . . and exact her vengeance.",
            "rating": 4.14190687361419,
            "ratings_count": 451,
            "pages": 672,
            "release_date": "2019-01-01",
            "slug": "the-dragon-republic"
          }
        },
        {
          "book": {
            "title": "The Eye of the World",
            "description": "In the Third Age, an age of prophecy when the world and time themselves hang in the balance, the Dark One, imprisoned by the Creator, is stirring in Shayol Ghul.",
            "rating": 4.028685548293391,
            "ratings_count": 1377,
            "pages": 708,
            "release_date": "1990-01-01",
            "slug": "the-eye-of-the-world"
          }
        },
        {
          "book": {
            "title": "The Song of Achilles",
            "description": "A thrilling, profoundly moving, and utterly unique retelling of the legend of Achilles and the Trojan War from the bestselling author of Circe\n\nA tale of gods, kings, immortal fame, and the human heart, The Song of Achilles is a dazzling literary feat that brilliantly reimagines Homer’s enduring masterwork, The Iliad. An action-packed adventure, an epic love story, a marvelously conceived and executed page-turner, Miller’s monumental debut novel has already earned resounding acclaim from some of contemporary fiction’s brightest lights—and fans of Mary Renault, Bernard Cornwell, Steven Pressfield, and Colleen McCullough’s Masters of Rome series will delight in this unforgettable journey back to ancient Greece in the Age of Heroes.\n\n“A captivating retelling of The Iliad and events leading up to it through the point of view of Patroclus: it’s a hard book to put down, and any classicist will be enthralled by her characterisation of the goddess Thetis, which carries the true savagery and chill of antiquity.” — Donna Tartt, The Times",
            "rating": 4.246934225195095,
            "ratings_count": 1794,
            "pages": 384,
            "release_date": "2011-01-01",
            "slug": "the-song-of-achilles"
          }
        },
        {
          "book": {
            "title": "Mary Poppins",
            "description": "An extraordinary English nanny blows in on the East Wind with her parrot-headed umbrella and magic carpetbag and introduces her charges, Jane and Michael, to some delightful people and experiences.",
            "rating": 3.7169811320754715,
            "ratings_count": 106,
            "pages": 224,
            "release_date": "1934-01-01",
            "slug": "mary-poppins"
          }
        },
        {
          "book": {
            "title": "The BFG",
            "description": "The BFG is no ordinary bone-crunching giant. He is far too nice and jumbly. It's lucky for Sophie that he is. Had she been carried off in the middle of the night by the Bloodbottler, or any of the other giants—rather than the BFG—she would have soon become breakfast. When Sophie hears that the giants are flush-bunking off to England to swollomp a few nice little chiddlers, she decides she must stop them once and for all. And the BFG is going to help her!",
            "rating": 4.095833333333333,
            "ratings_count": 360,
            "pages": 199,
            "release_date": "1982-01-01",
            "slug": "the-bfg"
          }
        },
        {
          "book": {
            "title": "James and the Giant Peach",
            "description": "When James Henry Trotter accidentally drops some magic crystals by the old peach tree, strange things start to happen. The peach at the top of the tree begins to grow, and before long it's as big as a house. Then James discovers a secret entranceway into the fruit, and when he crawls inside, he meets a bunch of marvelous oversized friends — Old Green-Grasshopper, Centipede, Ladybug, Miss Spider, and more.\n\nAfter years of feeling like an outsider in the house of his despicable Aunt Sponge and Aunt Spiker, James has finally found a place where he belongs. With a snip of the stem, the peach starts rolling away, and the exciting adventure begins!",
            "rating": 3.821608040201005,
            "ratings_count": 398,
            "pages": 146,
            "release_date": "1961-01-01",
            "slug": "james-and-the-giant-peach"
          }
        },
        {
          "book": {
            "title": "The Crystal Cave",
            "description": "Fifth century Britain is a country of chaos and division after the Roman withdrawal. This is the world of young Merlin, the illegitimate child of a South Wales princess who will not reveal to her son his father's true identity. Yet Merlin is an extraordinary child, aware at the earliest age that he possesses a great natural gift - the Sight. Against a background of invasion and imprisonment, wars and conquest, Merlin emerges into manhood, and accepts his dramatic role in the New Beginning - the coming of King Arthur.",
            "rating": 3.8823529411764706,
            "ratings_count": 68,
            "pages": 514,
            "release_date": "1970-01-01",
            "slug": "the-crystal-cave"
          }
        },
        {
          "book": {
            "title": "The Crystal Cave",
            "description": "Fifth century Britain is a country of chaos and division after the Roman withdrawal. This is the world of young Merlin, the illegitimate child of a South Wales princess who will not reveal to her son his father's true identity. Yet Merlin is an extraordinary child, aware at the earliest age that he possesses a great natural gift - the Sight. Against a background of invasion and imprisonment, wars and conquest, Merlin emerges into manhood, and accepts his dramatic role in the New Beginning - the coming of King Arthur.",
            "rating": 3.8823529411764706,
            "ratings_count": 68,
            "pages": 514,
            "release_date": "1970-01-01",
            "slug": "the-crystal-cave"
          }
        },
        {
          "book": {
            "title": "The Lives of Christopher Chant",
            "description": "PerfectBound e-book exclusive extras: \"Diana Wynne Jones's The Chronicles of Chrestomanci: Nine Notes\"; and our exclusive interview with Diana Wynne Jones.His father and uncles are enchanters, his mother a powerful sorceress, yet nothing seems magical about Christopher Chant except his dreams. Night after night, he climbs through the formless Place Between and visits marvelous lands he calls the Almost Anywheres.",
            "rating": 4.267241379310345,
            "ratings_count": 58,
            "pages": 326,
            "release_date": "1988-01-01",
            "slug": "the-lives-of-christopher-chant"
          }
        },
        {
          "book": {
            "title": "An Ember in the Ashes",
            "description": "Under the Martial Empire, defiance is met with death. Those who do not vow their blood and bodies to the Emperor risk the execution of their loved ones and the destruction of all they hold dear.\n\nIt is in this brutal world, inspired by ancient Rome, that Laia lives with her grandparents and older brother. The family ekes out an existence in the Empire’s impoverished backstreets. They do not challenge the Empire. They’ve seen what happens to those who do.\n\nBut when Laia’s brother is arrested for treason, Laia is forced to make a decision. In exchange for help from rebels who promise to rescue her brother, she will risk her life to spy for them from within the Empire’s greatest military academy.\n\nThere, Laia meets Elias, the school’s finest soldier—and secretly, its most unwilling. Elias wants only to be free of the tyranny he’s being trained to enforce. He and Laia will soon realize that their destinies are intertwined—and that their choices will change the fate of the Empire itself.",
            "rating": 4.143236074270557,
            "ratings_count": 377,
            "pages": 470,
            "release_date": "2015-01-01",
            "slug": "an-ember-in-the-ashes"
          }
        },
        {
          "book": {
            "title": "Le Morte D'Arthur",
            "description": "The next elegant edition in the Knickerbocker Classic series, Le Morte d'Arthur is unabridged and complete. Originally published in 1485 by William Caxton, Sir Thomas Malory's Le Morte d'Arthur remains the most exciting and magical interpretation of the legend of King Arthur and the Knights of the Round Table. For Arthurian fans worldwide, this stunning gift edition has a cloth binding, ribbon marker, and is packaged neatly in an elegant slipcase. Featuring a new introduction and the elegant illustrations by Aubrey Beardsley (1872-1898), this volume of Le Morte d'Arthur is an indispensible classic for every home library.",
            "rating": 3.62,
            "ratings_count": 51,
            "pages": 643,
            "release_date": "1485-01-01",
            "slug": "le-morte-darthur"
          }
        },
        {
          "book": {
            "title": "Empire of Sand",
            "description": "A nobleman's daughter with magic in her blood. An empire built on the dreams of enslaved gods. Empire of Sand is Tasha Suri's lush, dazzling, Mughal India-inspired debut fantasy.\n\nThe Amrithi are outcasts; nomads descended of desert spirits, they are coveted and persecuted throughout the Ambhan Empire for the power in their blood.\n\nMehr is the illegitimate daughter of an imperial governor and an exiled Amrithi mother she can barely remember, but whose face and magic she has inherited. When Mehr's power comes to the attention of the Emperor's most feared mystics, she must use every ounce of will, subtlety, and power she possesses to resist their cruel agenda.\n\nAnd should she fail, the gods themselves may awaken seeking vengeance.",
            "rating": 3.769230769230769,
            "ratings_count": 52,
            "pages": 464,
            "release_date": "2018-01-01",
            "slug": "empire-of-sand"
          }
        },
        {
          "book": {
            "title": "The Fellowship of the Ring",
            "description": "In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell into the hands of Bilbo Baggins, as told in The Hobbit.\n\nIn a sleepy village in the Shire, young Frodo Baggins finds himself faced with an immense task, as his elderly cousin Bilbo entrusts the Ring to his care. Frodo must leave his home and make a perilous journey across Middle-earth to the Cracks of Doom, there to destroy the Ring and foil the Dark Lord in his evil purpose.",
            "rating": 4.400972897845726,
            "ratings_count": 2878,
            "pages": 407,
            "release_date": "1954-01-01",
            "slug": "the-fellowship-of-the-ring"
          }
        },
        {
          "book": {
            "title": "The Poppy War",
            "description": "“I have no doubt this will end up being the best fantasy debut of the year [...] I have absolutely no doubt that [Kuang’s] name will be up there with the likes of Robin Hobb and N.K. Jemisin.” -- Booknest A Library Journal, Paste Magazine, Vulture, BookBub, and ENTROPY Best Books pick! Washington Post \"5 Best Science Fiction and Fantasy Novel\" pick! A Bustle \"30 Best Fiction Books\" pick! A brilliantly imaginative talent makes her exciting debut with this epic historical military fantasy, inspired by the bloody history of China’s twentieth century and filled with treachery and magic, in the tradition of Ken Liu’s Grace of Kings and N.K. Jemisin’s Inheritance Trilogy. When Rin aced the Keju—the Empire-wide test to find the most talented youth to learn at the Academies—it was a shock to everyone: to the test officials, who couldn’t believe a war orphan from Rooster Province could pass without cheating; to Rin’s guardians, who believed they’d finally be able to marry her off and further their criminal enterprise; and to Rin herself, who realized she was finally free of the servitude and despair that had made up her daily existence. That she got into Sinegard—the most elite military school in Nikan—was even more surprising. But surprises aren’t always good. Because being a dark-skinned peasant girl from the south is not an easy thing at Sinegard. Targeted from the outset by rival classmates for her color, poverty, and gender, Rin discovers she possesses a lethal, unearthly power—an aptitude for the nearly-mythical art of shamanism. Exploring the depths of her gift with the help of a seemingly insane teacher and psychoactive substances, Rin learns that gods long thought dead are very much alive—and that mastering control over those powers could mean more than just surviving school. For while the Nikara Empire is at peace, the Federation of Mugen still lurks across a narrow sea. The militarily advanced Federation occupied Nikan for decades after the First Poppy War, and only barely lost the continent in the Second. And while most of the people are complacent to go about their lives, a few are aware that a Third Poppy War is just a spark away . . . Rin’s shamanic powers may be the only way to save her people. But as she finds out more about the god that has chosen her, the vengeful Phoenix, she fears that winning the war may cost her humanity . . . and that it may already be too late.",
            "rating": 3.9604060913705585,
            "ratings_count": 985,
            "pages": 544,
            "release_date": "2018-01-01",
            "slug": "the-poppy-war"
          }
        },
        {
          "book": {
            "title": "The Voyage of the Dawn Treader",
            "description": "Lucy, Edmund, and their cousin travel back to Narnia through a painting where they board a ship named \"The Dawn Treader.\" They find King Caspian and a mouse on the ship and they find mystical creatures and go on a mission that will decide Narnia's fate!",
            "rating": 3.9045936395759715,
            "ratings_count": 566,
            "pages": 256,
            "release_date": "1952-01-01",
            "slug": "the-voyage-of-the-dawn-treader"
          }
        },
        {
          "book": {
            "title": "Trail of Lightning",
            "description": "\"While most of the world has drowned beneath the sudden rising waters of a climate apocalypse, Dinétah (formerly the Navajo reservation) has been reborn. The gods and heroes of legend walk the land, but so do monsters. Maggie Hoskie is a Dinétah monster hunter, a supernaturally gifted killer. When a small town needs help finding a missing girl, Maggie is their last best hope. But what Maggie uncovers about the monster is much more terrifying than anything she could imagine. Maggie reluctantly enlists the aid of Kai Arviso, an unconventional medicine man, and together they travel the rez, unraveling clues from ancient legends, trading favors with tricksters, and battling dark witchcraft in a patchwork world of deteriorating technology. As Maggie discovers the truth behind the killings, she will have to confront her past if she wants to survive.\" --amazon.com.",
            "rating": 3.836842105263158,
            "ratings_count": 190,
            "pages": 287,
            "release_date": "2018-01-01",
            "slug": "trail-of-lightning"
          }
        },
        {
          "book": {
            "title": "Ozma of Oz",
            "description": "When a storm blows Dorothy to the land of Ev where lunches grow on trees, she meets the Scarecrow, the Tin Woodman, the Cowardly Lion, and Princess Ozma, and together they set out to free the Queen of Ev and her ten children.",
            "rating": 3.5377358490566038,
            "ratings_count": 53,
            "pages": 188,
            "release_date": "1907-01-01",
            "slug": "ozma-of-oz"
          }
        },
        {
          "book": {
            "title": "Five Children and It",
            "description": null,
            "rating": 3.75,
            "ratings_count": 36,
            "pages": null,
            "release_date": null,
            "slug": "five-children-and-it"
          }
        },
        {
          "book": {
            "title": "Ella Enchanted",
            "description": "In this novel based on the story of Cinderella, Ella struggles against the childhood curse that forces her to obey any order given to her.",
            "rating": 4.155172413793103,
            "ratings_count": 29,
            "pages": 292,
            "release_date": "1997-01-01",
            "slug": "ella-enchanted"
          }
        },
        {
          "book": {
            "title": "Who Fears Death",
            "description": "In a far future, post-nuclear-holocaust Africa, genocide plagues one region. The aggressors, the Nuru, have decided to follow the Great Book and exterminate the Okeke. But when the only surviving member of a slain Okeke village is brutally raped, she manages to escape, wandering farther into the desert. She gives birth to a baby girl with hair and skin the color of sand and instinctively knows that her daughter is different. She names her daughter Onyesonwu, which means \"Who Fears Death?\" in an ancient African tongue.\n\nReared under the tutelage of a mysterious and traditional shaman, Onyesonwu discovers her magical destiny – to end the genocide of her people. The journey to fulfill her destiny will force her to grapple with nature, tradition, history, true love, the spiritual mysteries of her culture – and eventually death itself.",
            "rating": 3.76,
            "ratings_count": 75,
            "pages": 386,
            "release_date": "2010-01-01",
            "slug": "who-fears-death"
          }
        },
        {
          "book": {
            "title": "The Subtle Knife",
            "description": "Lost in a new world, Lyra finds Will—a boy on the run, a murderer—a worthy and welcome ally. For this is a world where soul-eating Specters stalk the streets and witches share the skies with troops of angels.\n\nEach is searching—Lyra for the meaning of Dark Matter, Will for his missing father—but what they find instead is a deadly secret, a knife of untold power. And neither Lyra nor Will suspects how tightly their lives, their loves, their destinies are bound together...until they are split apart.",
            "rating": 4.122023809523809,
            "ratings_count": 840,
            "pages": 326,
            "release_date": "1995-07-01",
            "slug": "the-subtle-knife"
          }
        },
        {
          "book": {
            "title": "Alice Through the Looking-glass: And What Alice Found There",
            "description": "The sequel to 'Alice's Adventures in Wonderland' and popularly known as Alice Through the Looking Glass is at first glance the polar opposite of the first book. Set in winter, as opposed to Summer, inside as opposed to outdoors, uses different plot devices, such as mirror and chess imagery, etc but actually carries on the same themes of polymorphic characters and nonsense plotlines.",
            "rating": 3.9072164948453607,
            "ratings_count": 194,
            "pages": 112,
            "release_date": "1865-11-01",
            "slug": "alice-through-the-looking-glass-and-what-alice-found-there"
          }
        },
        {
          "book": {
            "title": "Haroun and the Sea of Stories",
            "description": "Set in an exotic Eastern landscape peopled by magicians and fantastic talking animals, this classic children's novel inhabits the same imaginative space as *The Lord of the Rings*, *The Alchemist*, and *The Wizard of Oz*. In this captivating work of fantasy, Haroun sets out on an adventure to restore the poisoned source of the sea of stories. On the way, he encounters many foes, all intent on draining the sea of all its storytelling powers.",
            "rating": 3.986842105263158,
            "ratings_count": 76,
            "pages": 227,
            "release_date": "1990-01-01",
            "slug": "haroun-and-the-sea-of-stories"
          }
        },
        {
          "book": {
            "title": "Pet",
            "description": "Pet is here to hunt a monster. Are you brave enough to look? \n\nThere are no monsters anymore, or so the children in Lucille are taught. Jam and her best friend, Redemption, have grown up with the lesson that the city is safe for everyone. But when Jam meets Pet, a creature who some might call monstrous but, in reality, is anything but, she must reconsider what she's been told. Pet has emerged from one of her mother's paintings to hunt a true monster--and the shadow of something grim lurks in Redemption's house. No one has encountered monsters in years, though, and Jam's quest to protect her best friend and uncover the truth is met with doubt and disbelief. \n\nThis award-winning novel from a rising-star author asks: What really makes a monster, and how do you save the world from something if no one will admit it exists?",
            "rating": 4.2272727272727275,
            "ratings_count": 121,
            "pages": 210,
            "release_date": "2010-01-01",
            "slug": "pet"
          }
        },
        {
          "book": {
            "title": "The Once and Future King",
            "description": "T. H. White’s masterful retelling of the saga of King Arthur is a fantasy classic as legendary as Excalibur and Camelot, and a poignant story of adventure, romance, and magic that has enchanted readers for generations.\n \nOnce upon a time, a young boy called “Wart” was tutored by a magician named Merlyn in preparation for a future he couldn’t possibly imagine. A future in which he would ally himself with the greatest knights, love a legendary queen and unite a country dedicated to chivalrous values. A future that would see him crowned and known for all time as Arthur, King of the Britons.\n \nDuring Arthur’s reign, the kingdom of Camelot was founded to cast enlightenment on the Dark Ages, while the knights of the Round Table embarked on many a noble quest. But Merlyn foresaw the treachery that awaited his liege: the forbidden love between Queen Guenever and Lancelot, the wicked plots of Arthur’s half-sister Morgause and the hatred she fostered in Mordred that would bring an end to the king’s dreams for Britain—and to the king himself.",
            "rating": 3.8025477707006368,
            "ratings_count": 157,
            "pages": 650,
            "release_date": "1958-01-01",
            "slug": "the-once-and-future-king"
          }
        },
        {
          "book": {
            "title": "A Wrinkle in Time",
            "description": "It was a dark and stormy night; Meg Murry, her small brother Charles Wallace, and her mother had come down to the kitchen for a midnight snack when they were upset by the arrival of a most disturbing stranger.\n\n\"Wild nights are my glory,\" the unearthly stranger told them. \"I just got caught in a downdraft and blown off course. Let me sit down for a moment, and then I'll be on my way. Speaking of ways, by the way, there is such a thing as a tesseract.\"\n\nA tesseract (in case the reader doesn't know) is a wrinkle in time. To tell more would rob the reader of the enjoyment of Miss L'Engle's unusual book. A Wrinkle in Time, winner of the Newberry Medal in 1963, is the story of the adventures in space and time of Meg, Charles Wallace, and Calvin O'Keefe (athlete, student, and one of the most popular boys in high school). They are in search of Meg's father, a scientist who disappeared while engaged in secret work for the government on the tesseract problem.",
            "rating": 3.7422680412371134,
            "ratings_count": 1067,
            "pages": 256,
            "release_date": "1962-01-01",
            "slug": "a-wrinkle-in-time"
          }
        },
        {
          "book": {
            "title": "Alice's Adventures in Wonderland and Other Tales",
            "description": "Alice's adventures in Wonderland --\r\nThrough the looking glass --\r\nVerse --\r\nStories.",
            "rating": 4.5,
            "ratings_count": 10,
            "pages": 560,
            "release_date": "2016-07-01",
            "slug": "alices-adventures-in-wonderland-and-other-tales"
          }
        },
        {
          "book": {
            "title": "My Life in the Bush of Ghosts",
            "description": "The adventures of an African boy who strays into the world of the dead where his is lost for twenty-four years. Incorporates many unrecorded African myths.",
            "rating": 3,
            "ratings_count": 2,
            "pages": 170,
            "release_date": "1954-01-01",
            "slug": "my-life-in-the-bush-of-ghosts"
          }
        },
        {
          "book": {
            "title": "Brown Girl in the Ring",
            "description": null,
            "rating": 3.5483870967741935,
            "ratings_count": 31,
            "pages": 250,
            "release_date": "2001-03-15",
            "slug": "brown-girl-in-the-ring"
          }
        },
        {
          "book": {
            "title": "Woven in Moonlight",
            "description": "Ximena is the decoy Condesa, a stand-in for the last remaining Illustrian royal. Her people lost everything when the usurper, Atoc, used an ancient relic to summon ghosts and drive the Illustrians from La Ciudad. Now Ximena’s motivated by her insatiable thirs\n\nXimena is the decoy Condesa, a stand-in for the last remaining Illustrian royal. Her people lost everything when the usurper, Atoc, used an ancient relic to summon ghosts and drive the Illustrians from La Ciudad. Now Ximena’s motivated by her insatiable thirst for revenge, and her rare ability to spin thread from moonlight. When Atoc demands the real Condesa’s hand in marriage, it’s Ximena’s duty to go in her stead. She relishes the chance, as Illustrian spies have reported that Atoc’s no longer carrying his deadly relic. \n\nIf Ximena can find it, she can return the true aristócrata to their rightful place. She hunts for the relic, using her weaving ability to hide messages in tapestries for the resistance. But when a masked vigilante, a warm-hearted princess, and a thoughtful healerchallenge Ximena, her mission becomes more complicated. There could be a way to overthrow the usurper without starting another war, but only if Ximena turns her back on revenge—and her Condesa.",
            "rating": 3.5454545454545454,
            "ratings_count": 22,
            "pages": 400,
            "release_date": "2020-01-01",
            "slug": "woven-in-moonlight"
          }
        },
        {
          "book": {
            "title": "Alanna: The First Adventure",
            "description": "\"From now on, I'm Alan of Trebond, the younger twin. I'll be a knight.\r\n\r\nAnd so yound Alanna of Trebond begins the journey to knighthood. Though a girl, Alanna has always craved the adventure and daring allowed only for boys; her twin brother, Thom, yearns to learn the art of magin. So one day they decide to switch places. Disguised as a girl, Thom heads for the convent to learn magic; Alanna, pretending to be a boy, is on her way to the castle of King Roald to begin training as a page.\r\n\r\nBut the road to knighthood is not an easy one. As Alanna masters the skills necessary for battle, she must also learn to control her heart and discern her enemies from her allies.\r\n\r\nFilled with swords and scorcery, adventure and intrigue, good and evil, Alanna's first adventure begins--one that will lead to the fulfillment of her dreams and the magical destiny that will mke her a legend in her land.",
            "rating": 4.098039215686274,
            "ratings_count": 204,
            "pages": 274,
            "release_date": "1983-01-01",
            "slug": "alanna"
          }
        },
        {
          "book": {
            "title": "The Princess Bride",
            "description": "*The Princess Bride is a timeless tale that pits country against country, good against evil, love against hate. This incredible journey and artfully rendered love story is peppered with strange beasties monstrous and gentle, memorable surprises both terrible and sublime, and such unforgettable characters as...*\r\n\r\n**Westley**, the handsome farm boy who risks death (and much worse) for the woman he loves; **Inigo**, the Spanish swordsman who lives only to avenge his father's death; **Fezzik**, the gentlest giant ever to have uprooted a tree with his bear hands; **Vizzini**, the evil Sicilian, with a mind so keen he's foiled by his own perfect logic; **Prince Humperdinck**, the eviler ruler of Guilder, who has an equally insatiable thirst for war and beauteous Buttercup; **Count Rugen**, the evilest man of all, who thrives on the excruciating pain of others; **Miracle Max**, the King's ex-Miracle Man, who can raise the dead (kind of); and, of course, **Buttercup**... the princess bride, the most perfect, beautiful woman in the history of the world!",
            "rating": 4.168838862559242,
            "ratings_count": 844,
            "pages": 399,
            "release_date": "1973-01-01",
            "slug": "the-princess-bride"
          }
        },
        {
          "book": {
            "title": "Ella Enchanted (Ella Enchanted #1)",
            "description": null,
            "rating": 3.9871323529411766,
            "ratings_count": 272,
            "pages": null,
            "release_date": null,
            "slug": "ella-enchanted-ella-enchanted-1"
          }
        },
        {
          "book": {
            "title": "The Hundred Thousand Kingdoms",
            "description": "Yeine Darr is an outcast from the barbarian north.  But when her mother dies under mysterious circumstances, she is summoned to the majestic city of Sky.  There, to her shock, Yeine is named an heiress to the king.  But the throne of the Hundred Thousand Kingdoms is not easily won, and Yeine is thrust into a vicious power struggle with cousins she never knew she had.  As she fights for her life, she draws ever closer to the secrets of her mother's death and her family's bloody history.With the fate of the world hanging in the balance, Yeine will learn how perilous it can be when love and hate - and gods and mortals - are bound inseparably together.",
            "rating": 3.859322033898305,
            "ratings_count": 295,
            "pages": 432,
            "release_date": "2010-01-01",
            "slug": "the-hundred-thousand-kingdoms"
          }
        },
        {
          "book": {
            "title": "Challenge to Efrafa",
            "description": "Hazel, Bigwig, Pipkin, Fiver and Blackberry flee their warren afer Fiver's premonition of impending destruction. They eventually reach their promised land at Watership Down after a tiring, exciting and, at times, life-threatening adventure. Then, Holly, from their old waren arrives, wounded. Television tie-in novel.",
            "rating": null,
            "ratings_count": 0,
            "pages": 73,
            "release_date": "1999-09-23",
            "slug": "challenge-to-efrafa"
          }
        },
        {
          "book": {
            "title": "Akata Witch",
            "description": "Akata Witch transports the reader to a magical place where nothing is quite as it seems. Born in New York, but living in Aba, Nigeria, twelve-year old Sunny is understandably a little lost. She is albino and thus, incredibly sensitive to the sun. All Sunny wants to do is be able to play football and get through another day of school without being bullied. But once she befriends Orlu and Chichi, Sunny is plunged into the world of the Leopard People, where your worst defect becomes your greatest asset. \n\nTogether, Sunny, Orlu, Chichi and Sasha form the youngest ever Oha Coven. Their mission is to track down Black Hat Otokoto, the man responsible for kidnapping and maiming children. Will Sunny be able to overcome the killer with powers stronger than her own, or will the future she saw in the flames become reality?",
            "rating": 3.989655172413793,
            "ratings_count": 145,
            "pages": 349,
            "release_date": "2011-01-01",
            "slug": "akata-witch"
          }
        },
        {
          "book": {
            "title": "The Wrath and the Dawn",
            "description": "Every dawn brings horror to a different family in a land ruled by a killer. Khalid, the eighteen-year-old Caliph of Khorasan, takes a new bride each night only to have her executed at sunrise. So it is a suspicious surprise when sixteen-year-old Shahrzad volunteers to marry Khalid. But she does so with a clever plan to stay alive and exact revenge on the Caliph for the murder of her best friend and countless other girls. Shazi’s wit and will, indeed, get her through to the dawn that no others have seen, but with a catch . . . she’s falling in love with the very boy who killed her dearest friend.\n\nShe discovers that the murderous boy-king is not all that he seems and neither are the deaths of so many girls. Shazi is determined to uncover the reason for the murders and to break the cycle once and for all.",
            "rating": 3.785310734463277,
            "ratings_count": 177,
            "pages": 418,
            "release_date": "2015-01-01",
            "slug": "the-wrath-and-the-dawn"
          }
        },
        {
          "book": {
            "title": "Aru Shah and the Song of Death",
            "description": "********Aru** is only just getting the hang of this whole Pandava thing when the Otherworld goes into full panic mode. The god of love's bow and arrow have gone missing, and the thief isn't playing Cupid. Instead, they're turning people into heartless fighting-machine zombies.\r\nIf that weren't bad enough, somehow Aru gets framed as the thief. If she doesn't find the arrow by the next full moon, she'll be kicked out of the Otherworld. For good.\r\n\r\nBut, for better or worse, she won't be going it alone. Along with her soul-sister, Mini, Aru will team up with Brynne, an ultra-strong girl who knows more than she lets on, and Aiden, the boy who lives across the street and is also hiding plenty of secrets.\r\n\r\nTogether they'll battle demons, travel through a glittering and dangerous serpent realm, and discover that their enemy isn't at all who they expected.",
            "rating": 4.113636363636363,
            "ratings_count": 22,
            "pages": 400,
            "release_date": "2019-01-01",
            "slug": "aru-shah-and-the-song-of-death"
          }
        },
        {
          "book": {
            "title": "Spindle's End",
            "description": "The evil fairy Pernicia has set a curse on Princess Briar-Rose: she is fated to prick her finger on the spindle of a spinning wheel and fall into an endless, poisoned sleep. Katriona, a young fairy, kidnaps the princess in order to save her; she and her aunt raise the child in their small village, where no one knows her true identity. But Pernicia is looking for her, intent on revenge for a defeat four hundred years old. Robin McKinley's masterful version of Sleeping Beauty is, like all of her work, a remarkable literary feat.",
            "rating": 4,
            "ratings_count": 30,
            "pages": 434,
            "release_date": "2002-05-13",
            "slug": "spindles-end"
          }
        },
        {
          "book": {
            "title": "The Wee Free Men",
            "description": "A riotous, wise, and gripping junior Discworld novel from the Carnegie Medal-winning author and acknowledged master of comic fantasy.Nine-year-old Tiffany Aching thinks her Granny Aching - a wise shepherd - might have been a witch, but now Granny Aching is dead and it's up to Tiffany to work it all out when strange things begin happening: a fairy-tale monster in the stream, a headless horseman and, strangest of all, the tiny blue men in kilts, the Wee Free Men, who have come looking for the new 'hag'. These are the Nac Mac Feegles, the pictsies, who like nothing better than thievin', fightin' and drinkin'. Then Tiffany's young brother goes missing and Tiffany and the Wee Free Men must join forces to save him from the Queen of the Fairies-",
            "rating": 4.215488215488215,
            "ratings_count": 297,
            "pages": 336,
            "release_date": "2003-01-01",
            "slug": "the-wee-free-men"
          }
        },
        {
          "book": {
            "title": "The Phantom Tollbooth",
            "description": "For Milo, everything’s a bore. When a tollbooth mysteriously appears in his room, he drives through only because he’s got nothing better to do. But on the other side, things seem different. Milo visits the Island of Conclusions (you get there by jumping), learns about time from a ticking watchdog named Tock, and even embarks on a quest to rescue Rhyme and Reason! Somewhere along the way, Milo realizes something astonishing. Life is far from dull. In fact, it’s exciting beyond his wildest dreams!\r\n--back cover",
            "rating": 4.248062015503876,
            "ratings_count": 387,
            "pages": 268,
            "release_date": "1961-01-01",
            "slug": "the-phantom-tollbooth"
          }
        },
        {
          "book": {
            "title": "Harry Potter and the Sorcerer's Stone",
            "description": "Harry Potter has never been the star of a Quidditch team, scoring points while riding a broom far above the ground. He knows no spells, has never helped to hatch a dragon, and has never worn a cloak of invisibility.\n\nAll he knows is a miserable life with the Dursleys, his horrible aunt and uncle, and their abominable son, Dudley - a great big swollen spoiled bully. Harry's room is a tiny closet at the foot of the stairs, and he hasn't had a birthday party in eleven years.\n\nBut all that is about to change when a mysterious letter arrives by owl messenger: a letter with an invitation to an incredible place that Harry - and anyone who reads about him - will find unforgettable.\n\nFor it's there that he finds not only friends, aerial sports, and magic in everything from classes to meals, but a great destiny that's been waiting for him... if Harry can survive the encounter.",
            "rating": 4.268662034562623,
            "ratings_count": 5613,
            "pages": 309,
            "release_date": "1993-01-01",
            "slug": "harry-potter-and-the-sorcerers-stone"
          }
        },
        {
          "book": {
            "title": "Blanca & Roja",
            "description": "The del Cisne girls have never just been sisters; they're also rivals, Blanca as obedient and graceful as Roja is vicious and manipulative. They know that, because of a generations-old spell, their family is bound to a bevy of swans deep in the woods. They know that, one day, the swans will pull them into a dangerous game that will leave one of them a girl, and trap the other in the body of a swan.   \n\nBut when two local boys become drawn into the game, the swans' spell intertwines with the strange and unpredictable magic lacing the woods, and all four of their fates depend on facing truths that could either save or destroy them. Blanca & Roja is the captivating story of sisters, friendship, love, hatred, and the price we pay to protect our hearts.",
            "rating": 3.8461538461538463,
            "ratings_count": 13,
            "pages": 375,
            "release_date": "2018-01-01",
            "slug": "blanca-roja"
          }
        },
        {
          "book": {
            "title": "The Golden Compass",
            "description": "Lyra is rushing to the cold, far North, where witch clans and armored bears rule. North, where the Gobblers take the children they steal—including her friend Roger. North, where her fearsome uncle Asriel is trying to build a bridge to a parallel world.\n\nCan one small girl make a difference in such great and terrible endeavors? This is Lyra: a savage, a schemer, a liar, and as fierce and true a champion as Roger or Asriel could want.\n\nBut what Lyra doesn't know is that to help one of them will be to betray the other...\n\nA masterwork of storytelling and suspense, Philip Pullman's award-winning The Golden Compass is the first in the His Dark Materials series, which continues with The Subtle Knife and The Amber Spyglass.",
            "rating": 4.013769889840881,
            "ratings_count": 1634,
            "pages": 399,
            "release_date": "1995-01-01",
            "slug": "the-golden-compass"
          }
        },
        {
          "book": {
            "title": "Mistborn: The Final Empire",
            "description": "What if the whole world were a dead, blasted wasteland?\r\n\r\nMistborn\r\nFor a thousand years the ash fell and no flowers bloomed. For a thousand years the Skaa slaved in misery and lived in fear. For a thousand years the Lord Ruler, the \"Sliver of Infinity,\" reigned with absolute power and ultimate terror, divinely invincible. Then, when hope was so long lost that not even its memory remained, a terribly scarred, heart-broken half-Skaa rediscovered it in the depths of the Lord Ruler's most hellish prison. Kelsier \"snapped\" and found in himself the powers of a Mistborn. A brilliant thief and natural leader, he turned his talents to the ultimate caper, with the Lord Ruler himself as the mark.\r\n\r\nKelsier recruited the underworld's elite, the smartest and most trustworthy allomancers, each of whom shares one of his many powers, and all of whom relish a high-stakes challenge. Then Kelsier reveals his ultimate dream, not just the greatest heist in history, but the downfall of the divine despot.\r\n\r\nBut even with the best criminal crew ever assembled, Kel's plan looks more like the ultimate long shot, until luck brings a ragged girl named Vin into his life. Like him, she's a half-Skaa orphan, but she's lived a much harsher life. Vin has learned to expect betrayal from everyone she meets. She will have to learn trust if Kel is to help her master powers of which she never dreamed.\r\n\r\nBrandon Sanderson, fantasy's newest master tale-spinner and author of the acclaimed debut Elantris, dares to turn a genre on its head by asking a simple question: What if the prophesied hero failed to defeat the Dark Lord? The answer will be found in the Misborn Trilogy, a saga of surprises that begins with the book in your hands. Fantasy will never be the same again.",
            "rating": 4.461524232334443,
            "ratings_count": 2703,
            "pages": 541,
            "release_date": "2006-01-01",
            "slug": "mistborn"
          }
        },
        {
          "book": {
            "title": "Six of Crows",
            "description": "\"Kaz is offered a chance at a deadly heist that could make him rich beyond his wildest dreams. But he can't pull it off alone.\n\nA convict with a thirst for revenge. A sharpshooter who can't walk away from a wager. A runaway with a privileged past. A spy known as the Wraith. A Heartrender using her magic to survive the slums. A thief with a gift for unlikely escapes. Six dangerous outcasts. One impossible heist. Kaz's crew is the only thing that might stand between the world and destruction - if they don't kill each other first.\"-- Provided by Amazon",
            "rating": 4.296078431372549,
            "ratings_count": 1275,
            "pages": 465,
            "release_date": "2015-01-01",
            "slug": "six-of-crows-2015"
          }
        },
        {
          "book": {
            "title": "The Return of the King",
            "description": "THE RETURN OF THE KING, which brings to a close the great epic of war and adventure begun in The Fellowship of the Ring and continued in The Two Towers, is the third and final part of J. R. R. Tolkien's masterpiece, \"The Lord of the Rings.\"\r\n\r\nIn these three books, which form one continuous narrative, Tolkien created the saga of the Hobbits of Middle-earth and the great War of the Rings. Praised by such writers and poets as W. H. Auden, Richard Hughes and C. S. Lewis, \"The Lord of the Rings\" - that special world of beauty and terror and meaning - holds a secure place among the books that will live.\r\n\r\n----------\r\n**Also contained in:**\r\n\r\n - [The Lord of the Rings][1]\r\n\r\n\r\n  [1]: https://openlibrary.org/works/OL27448W/The_Lord_of_the_Rings",
            "rating": 4.565934065934066,
            "ratings_count": 1001,
            "pages": 432,
            "release_date": "1950-06-30",
            "slug": "the-return-of-the-king"
          }
        },
        {
          "book": {
            "title": "The Night Circus",
            "description": "The circus arrives without warning. No announcements precede it. It is simply there, when yesterday it was not. Within the black-and-white striped canvas tents is an utterly unique experience full of breathtaking amazements. It is called Le Cirque des Rêves, and it is only open at night.\n\nBut behind the scenes, a fierce competition is underway: a duel between two young magicians, Celia and Marco, who have been trained since childhood expressly for this purpose by their mercurial instructors. Unbeknownst to them both, this is a game in which only one can be left standing. Despite the high stakes, Celia and Marco soon tumble headfirst into love, setting off a domino effect of dangerous consequences, and leaving the lives of everyone, from the performers to the patrons, hanging in the balance.",
            "rating": 3.932784041630529,
            "ratings_count": 1153,
            "pages": 387,
            "release_date": "0018-01-01",
            "slug": "the-night-circus"
          }
        },
        {
          "book": {
            "title": "City of Glass",
            "description": "To save her mother’s life, Clary must travel to the City of Glass, the ancestral home of the Shadowhunters—never mind that entering the city without permission is against the Law, and breaking the Law could mean death. To make things worse, she learns that Jace does not want her there, and Simon has been thrown in prison by the Shadowhunters, who are deeply suspicious of a vampire who can withstand sunlight.\n\nAs Clary uncovers more about her family’s past, she finds an ally in mysterious Shadowhunter Sebastian. With Valentine mustering the full force of his power to destroy all Shadowhunters forever, their only chance to defeat him is to fight alongside their eternal enemies. But can Downworlders and Shadowhunters put aside their hatred to work together? While Jace realizes exactly how much he’s willing to risk for Clary, can she harness her newfound powers to help save the Glass City—whatever the cost?\n\nLove is a mortal sin and the secrets of the past prove deadly as Clary and Jace face down Valentine in the third installment of bestselling series the Mortal Instruments.",
            "rating": 3.9283333333333332,
            "ratings_count": 600,
            "pages": 372,
            "release_date": "2009-01-01",
            "slug": "city-of-glass-cassandra-clare"
          }
        },
        {
          "book": {
            "title": "The Dark is Rising",
            "description": "On his eleventh birthday Will Stanton discovers that he is the last of the Old Ones, destined to seek the six magical Signs that will enabee the Old Ones to triumph over the evil forces of the Dark.",
            "rating": 4,
            "ratings_count": 121,
            "pages": 320,
            "release_date": "1965-01-01",
            "slug": "the-dark-is-rising-1965"
          }
        },
        {
          "book": {
            "title": "The Name of the Wind",
            "description": "Told in Kvothe's own voice, this is the tale of the magically gifted young man who grows to be the most notorious wizard his world has ever seen.\r\n\r\nThe intimate narrative of his childhood in a troupe of traveling players, his years spent as a near-feral orphan in a crime-ridden city, his daringly brazen yet successful bid to enter a legendary school of magic, and his life as a fugitive after the murder of a king form a gripping coming-of-age story unrivaled in recent literature.\r\n\r\nA high-action story written with a poet's hand, The Name of the Wind is a masterpiece that will transport readers into the body and mind of a wizard.",
            "rating": 4.431762395679922,
            "ratings_count": 2037,
            "pages": 669,
            "release_date": "2007-01-01",
            "slug": "the-name-of-the-wind"
          }
        },
        {
          "book": {
            "title": "We Hunt the Flame",
            "description": "Zafira is the Hunter, disguising herself as a man when she braves the cursed forest of the Arz to feed her people. Nasir is the Prince of Death, assassinating those foolish enough to defy his autocratic father, the sultan. If Zafira was exposed as a girl, all of her achievements would be rejected; if Nasir displayed his compassion, his father would punish him in the most brutal of ways. Both Zafira and Nasir are legends in the kingdom of Arawiya--but neither wants to be.\n\nWar is brewing, and the Arz sweeps closer with each passing day, engulfing the land in shadow. When Zafira embarks on a quest to uncover a lost artifact that can restore magic to her suffering world and stop the Arz, Nasir is sent by the sultan on a similar mission: retrieve the artifact and kill the Hunter. But an ancient evil stirs as their journey unfolds--and the prize they seek may pose a threat greater than either can imagine.",
            "rating": 3.6478260869565218,
            "ratings_count": 115,
            "pages": 480,
            "release_date": "2019-01-01",
            "slug": "we-hunt-the-flame"
          }
        },
        {
          "book": {
            "title": "The Two Towers",
            "description": "Frodo and the Companions of the Ring have been beset by danger during their quest to prevent the Ruling Ring from falling into the hands of the Dark Lord by destroying it in the Cracks of Doom. They have lost the wizard, Gandalf, in the battle with an evil spirit in the Mines of Moria; and at the Falls of Rauros, Boromir, seduced by the power of the Ring, tried to seize it by force. While Frodo and Sam made their escape the rest of the company were attacked by Orcs. Now they continue their journey alone down the great River Anduin – alone, that is, save for the mysterious creeping figure that follows wherever they go. J.R.R. Tolkien’s great work of imaginative fiction has been labelled both a heroic romance and a classic fantasy fiction. By turns comic and homely, epic and diabolic, the narrative moves through countless changes of scene and character in an imaginary world which is totally convincing in its detail.\r\n\r\n----------\r\n**Also contained in:**\r\n\r\n - [The Lord of the Rings][1]\r\n\r\n\r\n  [1]: https://openlibrary.org/works/OL27448W/The_Lord_of_the_Rings",
            "rating": 4.454718004338395,
            "ratings_count": 1844,
            "pages": 725,
            "release_date": "1954-01-01",
            "slug": "the-two-towers"
          }
        },
        {
          "book": {
            "title": "Circe",
            "description": "\"Circe\" by Madeline Miller is a mesmerizing reimagining of the Greek mythological character, Circe. Banished to a remote island for defying the gods, Circe's journey unfolds through enchanting prose as she discovers her own power and identity. With vivid storytelling and encounters with legendary figures, including Odysseus, the novel explores themes of strength, transformation, and belonging. \"Circe\" is a captivating blend of mythology and human emotion that offers an unforgettable reading experience.",
            "rating": 4.24282223579719,
            "ratings_count": 1637,
            "pages": 409,
            "release_date": "2018-01-01",
            "slug": "circe"
          }
        },
        {
          "book": {
            "title": "Where the Mountain Meets the Moon",
            "description": "Where the Mountain Meets the Moon is a fantasy-adventure children's novel inspired by Chinese folklore. It was written and illustrated by Grace Lin and published in 2009. The novel received a 2010 Newbery Honor and the 2010 Mythopoeic Fantasy Award for Children's Literature.",
            "rating": 4.142857142857143,
            "ratings_count": 42,
            "pages": null,
            "release_date": "2009-06-01",
            "slug": "where-the-mountain-meets-the-moon"
          }
        },
        {
          "book": {
            "title": "Get in Trouble",
            "description": "**SHE HAS BEEN HAILED BY MICHAEL CHABON** as \"the most darkly playful voice in American fiction\" and by Neil Gaiman as \"a national treasure.\" Now Kelly Link's eagerly awaited new collection--her first for adult readers in a decade--proves indelibly that this bewitchingly original writer is among the finest we have.\r\n\r\nLink has won an ardent following for her ability, with each new short story, to take readers deeply into an unforgettable, brilliantly constructed fictional universe. The nine exquisite examples in this collection show her in full command of her formidable powers. In \"The Summer People,\" a young girl in rural North Carolina serves as uneasy caretaker to the mysterious, never-quite-glimpsed visitors who inhabit the cottage behind her house. In \"I Can See Right Through You,\" a middle-aged movie star makes a disturbing trip to the Florida swamp where his former on- and off-screen love interest is shooting a ghost-hunting reality show. In \"The New Boyfriend,\" a suburban slumber party takes an unusual turn, and a teenage friendship is tested, when the spoiled birthday girl opens her big present: a life-sized animated doll.\r\n\r\nHurricanes, astronauts, evil twins, bootleggers, Ouija boards, iguanas, *The Wizard of Oz*, superheroes, the Pyramids...These are just some of the talismans of an imagination as capacious and as full of wonder as that of any writer today. But as fantastical as these stories can be, they are always grounded by sly humor and an innate generosity of feeling for the frailty--and the hidden strengths--of human beings. In *Get in Trouble*, this one-of-a-kind talent expands the boundaries of what short fiction can do.\r\n\r\nThis description comes from the publisher.",
            "rating": 3.4615384615384617,
            "ratings_count": 52,
            "pages": 280,
            "release_date": "2015-01-01",
            "slug": "get-in-trouble"
          }
        },
        {
          "book": {
            "title": "The Last Unicorn",
            "description": "*The unicorn lived in a lilac wood, and she lived all alone…*\r\n\r\n …so she ventured out from the safety of the enchanted forest on a quest for others of her kind. Joined along the way by the bumbling magician Schmendrick and the indomitable Molly Grue, the unicorn learns all about the joys and sorrows of life and love before meeting her destiny in the castle of a despondent monarch—and confronting the creature that would drive her kind to extinction....\r\n\r\nIn *The Last Unicorn*, renowned and beloved novelist Peter S. Beagle spins a poignant tale of love, loss, and wonder that has resonated with millions of readers around the world.",
            "rating": 3.909090909090909,
            "ratings_count": 209,
            "pages": 292,
            "release_date": "1968-01-01",
            "slug": "the-last-unicorn"
          }
        },
        {
          "book": {
            "title": "A Wizard of Earthsea",
            "description": "A boy grows to manhood while attempting to subdue the evil he unleashed on the world as an apprentice to the Master Wizard.",
            "rating": 3.897689768976898,
            "ratings_count": 909,
            "pages": 251,
            "release_date": "1968-01-01",
            "slug": "a-wizard-of-earthsea"
          }
        },
        {
          "book": {
            "title": "Outlander",
            "description": "Unrivaled storytelling. Unforgettable characters. Rich historical detail. These are the hallmarks of Diana Gabaldon’s work. Her New York Times bestselling Outlander novels have earned the praise of critics and captured the hearts of millions of fans. Here is the story that started it all, introducing two remarkable characters, Claire Beauchamp Randall and Jamie Fraser, in a spellbinding novel of passion and history that combines exhilarating adventure with a love story for the ages.\n\nScottish Highlands, 1945. Claire Randall, a former British combat nurse, is just back from the war and reunited with her husband on a second honeymoon when she walks through a standing stone in one of the ancient circles that dot the British Isles. Suddenly she is a Sassenach—an “outlander”—in a Scotland torn by war and raiding clans in the year of Our Lord . . . 1743.\n \nClaire is catapulted into the intrigues of a world that threatens her life, and may shatter her heart. Marooned amid danger, passion, and violence, Claire learns her only chance of safety lies in Jamie Fraser, a gallant young Scots warrior. What begins in compulsion becomes urgent need, and Claire finds herself torn between two very different men, in two irreconcilable lives.\n\n",
            "rating": 3.891341256366723,
            "ratings_count": 589,
            "pages": 627,
            "release_date": "1974-01-01",
            "slug": "outlander"
          }
        },
        {
          "book": {
            "title": "Jade City",
            "description": "\"Jade is the lifeblood of the island of Kekon. It has been mined, traded, stolen, and killed for—and for centuries, honorable Green Bone warriors like the Kaul family have used it to enhance their magical abilities and defend the island from foreign invasion.\n\nNow, the war is over and a new generation of Kauls vies for control of Kekon's bustling capital city. They care about nothing but protecting their own, cornering the jade market, and defending the districts under their protection. Ancient tradition has little place in this rapidly changing nation.\n\nWhen a powerful new drug emerges that lets anyone—even foreigners—wield jade, the simmering tension between the Kauls and the rival Ayt family erupts into open violence. The outcome of this clan war will determine the fate of all Green Bones—and of Kekon itself.\"-- Provided by Amazon",
            "rating": 4.0861204013377925,
            "ratings_count": 598,
            "pages": 540,
            "release_date": "2017-01-01",
            "slug": "jade-city"
          }
        },
        {
          "book": {
            "title": "The Fifth Season",
            "description": "It starts with the great red rift across the heart of the world's sole continent, spewing ash that blots out the sun. It starts with death, with a murdered son and a missing daughter. It starts with betrayal, and long dormant wounds rising up to fester.\n\nThis is the Stillness, a land long familiar with catastrophe, where the power of the earth is wielded as a weapon. And where there is no mercy.\n\nRead the first book in the critically acclaimed, three-time Hugo award-winning trilogy by NYT bestselling author N. K. Jemisin.",
            "rating": 4.34092792046396,
            "ratings_count": 1207,
            "pages": 468,
            "release_date": "2015-01-01",
            "slug": "the-fifth-season"
          }
        },
        {
          "book": {
            "title": "The Stone Sky",
            "description": "The Moon will soon return. Whether this heralds the destruction of humankind or something worse will depend on two women.\n\nEssun has inherited the power of Alabaster Tenring. With it, she hopes to find her daughter Nassun and forge a world in which every orogene child can grow up safe.\n\nFor Nassun, her mother's mastery of the Obelisk Gate comes too late. She has seen the evil of the world, and accepted what her mother will not admit: that sometimes what is corrupt cannot be cleansed, only destroyed.",
            "rating": 4.330294530154278,
            "ratings_count": 713,
            "pages": 464,
            "release_date": "2017-01-01",
            "slug": "the-stone-sky"
          }
        },
        {
          "book": {
            "title": "The Changeling",
            "description": "\"The wildly imaginative story of one man's thrilling odyssey through an enchanted world to find his wife, who has disappeared after having seemingly committed an unforgivable act of violence, from the award-winning author of The Devil in Silver and Big Machine\"--\n\n\"Apollo Kagwa has had strange dreams that have haunted him since childhood. An antiquarian book dealer with a business called Improbabilia, he is just beginning to settle into his new life as a committed and involved father, unlike his own father who abandoned him, when his wife Emma begins acting strange. Disconnected and uninterested in their new baby boy, Emma at first seems to be exhibiting all the signs of post-partum depression, but it quickly becomes clear that her troubles go far beyond that. Before Apollo can do anything to help, Emma commits a horrific act--beyond any parent's comprehension--and vanishes, seemingly into thin air. Thus begins Apollo's odyssey through a world he only thought he understood to find a wife and child who are nothing like he'd imagined. His quest begins when he meets a mysterious stranger who claims to have information about Emma's whereabouts. Apollo then begins a journey that takes him to a forgotten island in the East River of New York City, a graveyard full of secrets, a forest in Queens where immigrant legends still live, and finally back to a place he thought he had lost forever. This dizzying tale is ultimately a story about family and the unfathomable secrets of the people we love\"--",
            "rating": 3.7877358490566038,
            "ratings_count": 106,
            "pages": 448,
            "release_date": "2017-01-01",
            "slug": "the-changeling"
          }
        },
        {
          "book": {
            "title": "Children of Blood and Bone",
            "description": "They killed my mother.\nThey took our magic.\nThey tried to bury us.\n\nNow we rise.\n\nZélie Adebola remembers when the soil of Orïsha hummed with magic. Burners ignited flames, Tiders beckoned waves, and Zélie’s Reaper mother summoned forth souls.\n\nBut everything changed the night magic disappeared. Under the orders of a ruthless king, maji were killed, leaving Zélie without a mother and her people without hope.\n\nNow Zélie has one chance to bring back magic and strike against the monarchy. With the help of a rogue princess, Zélie must outwit and outrun the crown prince, who is hell-bent on eradicating magic for good.\n\nDanger lurks in Orïsha, where snow leoponaires prowl and vengeful spirits wait in the waters. Yet the greatest danger may be Zélie herself as she struggles to control her powers and her growing feelings for an enemy.",
            "rating": 3.9592391304347827,
            "ratings_count": 368,
            "pages": 544,
            "release_date": "2018-01-01",
            "slug": "children-of-blood-and-bone"
          }
        },
        {
          "book": {
            "title": "Harry Potter and the Half-Blood Prince",
            "description": "The war against Voldemort is not going well; even the Muggles have been affected. Dumbledore is absent from Hogwarts for long stretches of time, and the Order of the Phoenix has already suffered losses.\n\nAnd yet . . . As with all wars, life goes on. Sixth-year students learn to Apparate. Teenagers flirt and fight and fall in love. Harry receives some extraordinary help in Potions from the mysterious Half-Blood Prince. And with Dumbledore's guidance, he seeks out the full, complex story of the boy who became Lord Voldemort -- and thus finds what may be his only vulnerability.",
            "rating": 4.365524252105722,
            "ratings_count": 3443,
            "pages": 672,
            "release_date": "2005-01-01",
            "slug": "harry-potter-and-the-half-blood-prince"
          }
        },
        {
          "book": {
            "title": "Gods of Jade and Shadow",
            "description": "The Mayan god of death sends a young woman on a harrowing, life-changing journey in this dark, one-of-a-kind fairy tale inspired by Mexican folklore.\n\n“A spellbinding fairy tale rooted in Mexican mythology . . . Gods of Jade and Shadow is a magical fairy tale about identity, freedom, and love, and it’s like nothing you’ve read before.”—Bustle\n\nNEBULA AWARD FINALIST • NAMED ONE OF THE BEST BOOKS OF THE YEAR BY NPR • Tordotcom • The New York Public Library • BookRiot\n\nThe Jazz Age is in full swing, but Casiopea Tun is too busy cleaning the floors of her wealthy grandfather’s house to listen to any fast tunes. Nevertheless, she dreams of a life far from her dusty small town in southern Mexico. A life she can call her own. \n\nYet this new life seems as distant as the stars, until the day she finds a curious wooden box in her grandfather’s room. She opens it—and accidentally frees the spirit of the Mayan god of death, who requests her help in recovering his throne from his treacherous brother. Failure will mean Casiopea’s demise, but success could make her dreams come true.\n\nIn the company of the strangely alluring god and armed with her wits, Casiopea begins an adventure that will take her on a cross-country odyssey from the jungles of Yucatán to the bright lights of Mexico City—and deep into the darkness of the Mayan underworld.",
            "rating": 3.805555555555556,
            "ratings_count": 198,
            "pages": 352,
            "release_date": "2019-01-01",
            "slug": "gods-of-jade-and-shadow"
          }
        },
        {
          "book": {
            "title": "The Lion, the Witch and the Wardrobe",
            "description": "Four adventurous siblings—Peter, Susan, Edmund, and Lucy Pevensie—step through a wardrobe door and into the land of Narnia, a land frozen in eternal winter and enslaved by the power of the White Witch. But when almost all hope is lost, the return of the Great Lion, Aslan, signals a great change . . . and a great sacrifice.\n\nJourney into the land beyond the wardrobe! The Lion, the Witch and the Wardrobe is the second book in C. S. Lewis's classic fantasy series, which has been captivating readers of all ages for over sixty years. This is a stand-alone novel, but if you would like journey back to Narnia, read The Horse and His Boy, the third book in The Chronicles of Narnia.",
            "rating": 3.9484366428963247,
            "ratings_count": 1823,
            "pages": 206,
            "release_date": "1950-01-01",
            "slug": "the-lion-the-witch-and-the-wardrobe"
          }
        },
        {
          "book": {
            "title": "A Stranger in Olondria",
            "description": "Jevik travels to the city of Olondria where he is overtaken by a ghost from his past.",
            "rating": 3.4210526315789473,
            "ratings_count": 19,
            "pages": 299,
            "release_date": "2013-04-12",
            "slug": "a-stranger-in-olondria"
          }
        },
        {
          "book": {
            "title": "The Bone Clocks",
            "description": "Following a scalding row with her mother, fifteen-year-old Holly Sykes slams the door on her old life. But Holly is no typical teenage runaway: a sensitive child once contacted by voices she knew only as \"the radio people,\" Holly is a lightning rod for psychic phenomena. Now, as she wanders deeper into the English countryside, visions and coincidences reorder her reality until they assume the aura of a nightmare brought to life. For Holly has caught the attention of a cabal of dangerous mystics -- and their enemies. But her lost weekend is merely the prelude to a shocking disappearance that leaves her family irrevocably scarred. This unsolved mystery will echo through every decade of Holly's life, affecting all the people Holly loves -- even the ones who are not yet born. A Cambridge scholarship boy grooming himself for wealth and influence, a conflicted father who feels alive only while reporting from occupied Iraq, a middle-aged writer mourning his exile from the bestseller list -- all have a part to play in this surreal, invisible war on the margins of our world. From the medieval Swiss Alps to the nineteenth-century Australian bush, from a hotel in Shanghai to a Manhattan townhouse in the near future, their stories come together in moments of everyday grace and extraordinary wonder.",
            "rating": 3.9029126213592233,
            "ratings_count": 206,
            "pages": 595,
            "release_date": "2014-01-01",
            "slug": "the-bone-clocks"
          }
        },
        {
          "book": {
            "title": "Howl's Moving Castle",
            "description": "This entrancing classic fantasy novel is filled with surprises at every turn. An international bestseller, this much-loved book is the source for the Academy Award nominee for Best Animated Feature.\n\nSophie has the great misfortune of being the eldest of three daughters, destined to fail miserably should she ever leave home to seek her fate. But when she unwittingly attracts the ire of the Witch of the Waste, Sophie finds herself under a horrid spell that transforms her into an old lady. Her only chance at breaking it lies in the ever-moving castle in the hills: the Wizard Howl's castle.\n\nTo untangle the enchantment, Sophie must handle the heartless Howl, strike a bargain with a fire demon, and meet the Witch of the Waste head-on. Along the way, she discovers that there's far more to Howl—and herself—than first meets the eye.\n\nIn this giant jigsaw puzzle of a fantasy, people and things are never quite what they seem. Destinies are intertwined, identities exchanged, lovers confused. The Witch has placed a spell on Howl. Does the clue to breaking it lie in a famous poem? And what will happen to Sophie Hatter when she enters Howl's castle?\n\nAll fans of classic fantasy books deserve the pleasure of reading those by Diana Wynne Jones, whose acclaim included the World Fantasy Award for Life Achievement. As Neil Gaiman stated, she was \"quite simply the best writer for children of her generation.\"",
            "rating": 4.154639175257732,
            "ratings_count": 776,
            "pages": 429,
            "release_date": "1986-01-01",
            "slug": "howls-moving-castle"
          }
        },
        {
          "book": {
            "title": "A Torch Against the Night",
            "description": "This time it takes readers into the heart of the Empire as Laia and Elias fight their way north to liberate Laia’s brother from the horrors of Kauf Prison. Hunted by Empire soldiers, manipulated by the Commandant, and haunted by their pasts, Laia and Elias must outfox their enemies and confront the treacherousness of their own hearts.\n\nIn the city of Serra, Helene Aquilla finds herself bound to the will of the Empire’s twisted new leader, Marcus. When her loyalty is questioned, Helene finds herself taking on a mission to prove herself—a mission that might destroy her, instead.",
            "rating": 4.145833333333333,
            "ratings_count": 216,
            "pages": 496,
            "release_date": "2016-01-01",
            "slug": "a-torch-against-the-night"
          }
        },
        {
          "book": {
            "title": "Tigana",
            "description": "A masterful epic of magic, politics, war, and the power of love and hate—from the renowned author of The Fionavar Tapestry and Children of Earth and Sky. Tigana is the magical story of a beleaguered land struggling to be free. It is the tale of a people so cursed by the black sorcery of a cruel despotic king that even the name of their once-beautiful homeland cannot be spoken or remembered... But years after the devastation, a handful of courageous men and women embark upon a dangerous crusade to overthrow their conquerors and bring back to the dark world the brilliance of a long-lost name...Tigana. Against the magnificently rendered background of a world both sensuous and barbaric, this sweeping epic of a passionate people pursuing their dream is breathtaking in its vision, changing forever the boundaries of fantasy fiction.",
            "rating": 3.969849246231156,
            "ratings_count": 199,
            "pages": 688,
            "release_date": "1990-01-01",
            "slug": "tigana"
          }
        },
        {
          "book": {
            "title": "The Bloody Chamber",
            "description": "From familiar fairy tales and legends -- Red Riding Hood, Bluebeard, Puss-in-Boots, Beauty and the Beast, vampires, werewolves -- Angela Carter has created an absorbing collection of dark, sensual, fantastic stories.",
            "rating": 3.7222222222222223,
            "ratings_count": 81,
            "pages": 164,
            "release_date": "1978-01-01",
            "slug": "the-bloody-chamber"
          }
        },
        {
          "book": {
            "title": "The Palm-Wine Drinkard",
            "description": "'. . . brief, thronged, grisly and bewitching . . . written in English by a West African . . . Nothing is too prodigious or too trivial to put down in this tall, devilish story.' Dylan Thomas in the Observer",
            "rating": 3.5,
            "ratings_count": 6,
            "pages": 128,
            "release_date": "1952-01-01",
            "slug": "the-palm-wine-drinkard"
          }
        },
        {
          "book": {
            "title": "A Hero Born",
            "description": null,
            "rating": 3.6521739130434785,
            "ratings_count": 23,
            "pages": 398,
            "release_date": "1957-01-01",
            "slug": "a-hero-born"
          }
        },
        {
          "book": {
            "title": "The Wandering Unicorn",
            "description": null,
            "rating": null,
            "ratings_count": 0,
            "pages": null,
            "release_date": null,
            "slug": "the-wandering-unicorn"
          }
        },
        {
          "book": {
            "title": "The Arabian Nights",
            "description": "This Norton Critical Edition includes twenty-eight tales from The Arabian Nights translated by Husain Haddawy on the basis of the oldest existing Arabic manuscript.",
            "rating": 3.868055555555556,
            "ratings_count": 72,
            "pages": 523,
            "release_date": "2010-01-01",
            "slug": "the-arabian-nights-2010"
          }
        },
        {
          "book": {
            "title": "Witchmark",
            "description": "In an original world reminiscent of Edwardian England in the shadow of a World War, cabals of noble families use their unique magical gifts to control the fates of nations, while one young man seeks only to live a life of his own. Magic marked Miles Singer for suffering the day he was born, doomed either to be enslaved to his family's interest or to be committed to a witches' asylum. He went to war to escape his destiny and came home a different man, but he couldn't leave his past behind. The war between Aeland and Laneer leaves men changed, strangers to their friends and family, but even after faking his own death and reinventing himself as a doctor at a cash-strapped veterans' hospital, Miles can't hide what he truly is. When a fatally poisoned patient exposes Miles' healing gift and his witchmark, he must put his anonymity and freedom at risk to investigate his patient's murder. To find the truth he'll need to rely on the family he despises, and on the kindness of the most gorgeous man he's ever seen.",
            "rating": 3.9466666666666668,
            "ratings_count": 75,
            "pages": null,
            "release_date": "2018-01-01",
            "slug": "witchmark"
          }
        },
        {
          "book": {
            "title": "Good Omens: The Nice and Accurate Prophecies of Agnes Nutter, Witch",
            "description": "Armageddon only happens once, you know. They don't let you go around again until you get it right.\r\n\r\nAccording to the Nice and Accurate Prophecies of Agnes Nutter, Witch - the world's only totally reliable guide to the future, written in 1655, before she exploded - the world will end on a Saturday. \r\n\r\nNext Saturday, in fact. Just after tea...\r\n\r\nPeople have been predicting the end of the world almost from its very beginning, so it's only natural to be sceptical when a new date is set for Judgement Day.\r\n\r\nThis time though, the armies of Good and Evil really do appear to be massing. The four Bikers of the Apocalypse are hitting the road. But both the angels and demons - well, one fast-living demon and a somewhat fussy angel - would quite like the Rapture not to happen.\r\n\r\nOh, and someone seems to have misplaced the Antichrist...",
            "rating": 4.156513872135102,
            "ratings_count": 1658,
            "pages": 491,
            "release_date": "1990-01-01",
            "slug": "good-omens"
          }
        },
        {
          "book": {
            "title": "Dragonflight",
            "description": "Volume I of The Dragonriders of Pern®, the groundbreaking series by master storyteller Anne McCaffrey On a beautiful world called Pern, an ancient way of life is about to come under attack from a myth that is all too real. Lessa is an outcast survivor—her parents murdered, her birthright stolen—a strong young woman who has never stopped dreaming of revenge. But when an ancient threat to Pern reemerges, Lessa will rise—upon the back of a great dragon with whom she shares a telepathic bond more intimate than any human connection. Together, dragon and rider will fly . . . and Pern will be changed forever.",
            "rating": 3.9375,
            "ratings_count": 8,
            "pages": 310,
            "release_date": "2005-07-26",
            "slug": "dragonflight"
          }
        },
        {
          "book": {
            "title": "Redwall",
            "description": "When Redwall Abbey is threatened by the evil rat Cluny, it is up to Matthias, a young mouse, to destroy the enemy.",
            "rating": 3.9696356275303644,
            "ratings_count": 247,
            "pages": 351,
            "release_date": "1986-01-01",
            "slug": "redwall"
          }
        },
        {
          "book": {
            "title": "Swordspoint: A Melodrama of Manners",
            "description": "\"On the treacherous streets of Riverside, a man lives and dies by the sword. Even the nobles on the Hill turn to duels to settle their disputes. Within this elite, dangerous world, Richard St. Vier is the undisputed master, as skilled as he is ruthless--until a death by the sword is met with outrage instead of awe, and the city discovers that the line between hero and villain can be altered in the blink of an eye.\"  (Publisher synopsis)",
            "rating": 3.3,
            "ratings_count": 50,
            "pages": 269,
            "release_date": "1986-01-01",
            "slug": "swordspoint"
          }
        },
        {
          "book": {
            "title": "Beasts Made of Night",
            "description": "Taj is the most talented of the aki, young sin-eaters indentured by the mages to slay the sin-beasts. But Taj's livelihood comes at a terrible cost. When he kills a sin-beast, a tattoo of the beast appears on his skin while the guilt of committing the sin appears on his mind. Most aki are driven mad by the process, but 17-year-old Taj is cocky and desperate to provide for his family.",
            "rating": 3.1666666666666665,
            "ratings_count": 12,
            "pages": 304,
            "release_date": "2017-01-01",
            "slug": "beasts-made-of-night"
          }
        },
        {
          "book": {
            "title": "The Angelfall Trilogy",
            "description": "The incredible YA fantasy phenomenon, not to be missed by fans of Sarah J. Maas and Jennifer L. Armentrout. 'Seriously and completely addictive.' - Glamour The action-packed Penryn and the End of Days trilogy from Susan Ee: ANGELFALL, WORLD AFTER, END OF DAYS. Available together as a digital-only package for the first time.",
            "rating": 3.8354430379746836,
            "ratings_count": 79,
            "pages": 288,
            "release_date": "2015-10-22",
            "slug": "the-angelfall-trilogy"
          }
        }
      ]
    }
  }
}
